       01 REG-USUARIOS.
          03 ID-USUARIO                  PIC 9(2).
          03 NOME-USUARIO                PIC X(35).
          03 SENHA-USUARIO               PIC X(10).
          03 NUMERO-USUARIO              PIC X(11).
          03 EMAIL-USUARIO               PIC X(30).
